In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'c:\\Users\\Jake\\Documents\\Udemy Courses\\Machine Learning Recap Course\\Module 3 - Pandas'

In [3]:
ls

 Volume in drive C is Windows
 Volume Serial Number is 7E52-53CE

 Directory of c:\Users\Jake\Documents\Udemy Courses\Machine Learning Recap Course\Module 3 - Pandas

01/30/2025  04:52 PM    <DIR>          .
01/30/2025  04:52 PM    <DIR>          ..
01/25/2025  10:24 AM           755,141 01 - Series.ipynb
01/25/2025  01:17 PM           235,524 02 - Dataframes.ipynb
01/25/2025  03:08 PM           126,006 03 - Conditional Filtering.ipynb
01/25/2025  06:34 PM           146,022 04 - Useful Methods.ipynb
01/26/2025  01:10 PM            83,599 05 - Missing Data.ipynb
01/30/2025  10:15 AM           395,704 06 - GroupBy Operations.ipynb
01/30/2025  12:16 PM            68,501 07 - Combining DataFrames.ipynb
01/30/2025  02:44 PM            12,906 08 - Text Methods.ipynb
01/30/2025  04:51 PM            42,901 09 - Time Methods.ipynb
01/30/2025  05:15 PM             1,002 10 - Input And Output.ipynb
01/25/2025  09:46 AM               133 exercise4.py
01/21/2025  01:11 PM               177 movie_scores.csv
01/21/2025  01:11 PM            17,727 mpg.csv
01/21/2025  01:11 PM             5,459 RetailSales_BeerWineLiquor.csv
01/21/2025  01:11 PM            18,752 tips.csv
              15 File(s)      1,909,554 bytes
               2 Dir(s)  369,879,134,208 bytes free

In [4]:
import os

In [5]:
os.getcwd()

'c:\\Users\\Jake\\Documents\\Udemy Courses\\Machine Learning Recap Course\\Module 3 - Pandas'

Reading CSV Files:

In [7]:
df = pd.read_csv('example.csv')

In [8]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df = pd.read_csv('example.csv', header = None)

In [10]:
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [12]:
df = pd.read_csv('example.csv', index_col = 0)

In [13]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

Saving Dataframes To CSV Files:

In [14]:
df = pd.read_csv('example.csv')

In [15]:
df.to_csv('newfile.csv', index = False)

In [16]:
new = pd.read_csv('newfile.csv')

In [17]:
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Reading HTML Tables (From Websites):

In [18]:
url = 'http://en.wikipedia.org/wiki/World_population'

In [19]:
tables = pd.read_html(url)

In [20]:
len(tables)

27

In [21]:
tables[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1927,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",123,33,14,13,12,12,11,15,20

In [24]:
tables[3]

,Country / Dependency,Population,% of world,Date,Source (official or from the United Nations)
0,India,1425775850,17.5%,14 Apr 2023,UN projection[89]
1,China,1409670000,17.3%,17 Jan 2024,National annual estimate[90]
2,United States,337460797,4.14%,30 Jan 2025,National population clock[91]
3,Indonesia,278696200,3.42%,1 Jul 2023,National annual estimate[92]
4,Pakistan,229488994,2.81%,1 Jul 2022,UN projection[93]
5,Nigeria,216746934,2.66%,1 Jul 2022,UN projection[93]
6,Brazil,218735590,2.68%,30 Jan 2025,National population clock[94]
7,Bangladesh,168220000,2.06%,1 Jul 2020,Annual Population Estimate[95]
8,Russia,147190000,1.80%,1 Oct 2021,2021 preliminary census results[96]
9,Mexico,128271248,1.57%,31 Mar 2022,NaN

In [25]:
tables[3].columns

Index(['Country / Dependency', 'Population', '% of world', 'Date',
       'Source (official or from the United Nations)'],
      dtype='object')

In [26]:
world_topten = tables [3]

In [27]:
world_topten

,Country / Dependency,Population,% of world,Date,Source (official or from the United Nations)
0,India,1425775850,17.5%,14 Apr 2023,UN projection[89]
1,China,1409670000,17.3%,17 Jan 2024,National annual estimate[90]
2,United States,337460797,4.14%,30 Jan 2025,National population clock[91]
3,Indonesia,278696200,3.42%,1 Jul 2023,National annual estimate[92]
4,Pakistan,229488994,2.81%,1 Jul 2022,UN projection[93]
5,Nigeria,216746934,2.66%,1 Jul 2022,UN projection[93]
6,Brazil,218735590,2.68%,30 Jan 2025,National population clock[94]
7,Bangladesh,168220000,2.06%,1 Jul 2020,Annual Population Estimate[95]
8,Russia,147190000,1.80%,1 Oct 2021,2021 preliminary census results[96]
9,Mexico,128271248,1.57%,31 Mar 2022,NaN

Saving Dataframes To HTML Files:

In [28]:
world_topten.to_html('sample_table.html', index = False)

Reading Excel Files:

In [30]:
df = pd.read_excel('my_excel_file.xlsx', sheet_name = 'First_Sheet')

In [31]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [32]:
wb = pd.ExcelFile('my_excel_file.xlsx')

In [33]:
wb.sheet_names

['First_Sheet']

In [34]:
excel_sheet_dict = pd.read_excel('my_excel_file.xlsx', sheet_name = None) #This reads all sheets and sets up a dictionary of dataframes

In [35]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [36]:
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [37]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

Saving Dataframes To Excel Files:

In [38]:
our_df = excel_sheet_dict['First_Sheet']

In [39]:
our_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [40]:
our_df.to_excel('example.xlsx', sheet_name = 'First_Sheet', index = False)

Creating A Temporary SQL Database:

In [53]:
from sqlalchemy import create_engine

In [59]:
temp_db = create_engine('sqlite:///:memory:')

In [60]:
df = pd.DataFrame(data = np.random.randint(low = 0, high = 100, size = (4, 4)), columns = ['a', 'b', 'c', 'd'])

In [61]:
df

    a   b   c   d
0  31  17   8   2
1  82  29  95  44
2  45  35  40  34
3  67  97  34  42

In [62]:
df.to_sql(name = 'new_table', con = temp_db, index = False)

4

Reading SQL Databases:

In [63]:
new_df = pd.read_sql(sql = 'new_table', con = temp_db) #Reading an entire SQL table

In [64]:
new_df

    a   b   c   d
0  31  17   8   2
1  82  29  95  44
2  45  35  40  34
3  67  97  34  42

In [65]:
result = pd.read_sql_query(sql = 'SELECT a,c FROM new_table', con = temp_db) #Reading a query from a SQL table

In [66]:
result

    a   c
0  31   8
1  82  95
2  45  40
3  67  34